[
  {
    "name": "Script Bot Prem",
    "image": "https://www.google.com/imgres?q=cara%20membuat%20folder%20di%20github&imgurl=https%3A%2F%2Fblogger.googleusercontent.com%2Fimg%2Fb%2FR29vZ2xl%2FAVvXsEidbvBP2pxMUhfsAg8x7R9a8fJBjNqaHTuKGVIReyeJXi_FaTJe5CyqCpgKr2kjrZXmsoIibFaytNlQoe8KebQYdlgSsBURQ-6IkQPlTEdp6rgcc4R_MrTxSMfJ94sKdGtr54ij4n6gZek%2Fs1600%2FScreenshot%2Bat%2B2019-07-28%2B14-57-20.png&imgrefurl=https%3A%2F%2Ffauzanashariblog.blogspot.com%2F2019%2F07%2Fmembuat-folder-di-repository-github-dan.html&docid=Y5D-9-tpgm_1YM&tbnid=pkhwL8tJhuqaxM&vet=12ahUKEwiI1Omn28eNAxXeyjgGHbgoAXoQM3oECG0QAA..i&w=1026&h=568&hcb=2&ved=2ahUKEwiI1Omn28eNAxXeyjgGHbgoAXoQM3oECG0QAA",
    "price": 120,
    "description": "Kita diminta untuk:\n\n1. Jangan menampilkan harga di awal (pada bagian produk card)\n\n2. Masukkan keterangan harga di menu DETAIL\n\n3. Arahkan tombol \"ORDER SEKARANG\" di modal DETAIL ke menu ORDER\n\n4. Jangan hilangkan fungsi ORDER untuk mengirim pesan ke WhatsApp\n\n5. Cek semua untuk memastikan tidak ada error\n\nLangkah-langkah:\n\n- Hapus bagian harga dari card produk (di dalam `.product-content`). Harga hanya akan ditampilkan di modal DETAIL.\n\n- Di modal DETAIL, tambahkan tombol \"ORDER SEKARANG\" yang akan membuka modal ORDER. Kita sudah punya tombol itu, tinggal pastikan fungsinya.\n\n- Pastikan di modal ORDER, data produk dan paket yang dipilih tetap terkirim ke WhatsApp.\n\nPerubahan:\n\n1. Pada setiap produk card, hapus elemen yang menampilkan harga. Yaitu hapus div dengan class `product-packages` yang berisi daftar paket dan harga. Karena harga hanya akan ditampilkan di modal detail.\n\n2. Di modal detail, kita sudah menampilkan daftar paket beserta harga. Di sini juga sudah ada tombol \"ORDER SEKARANG\" yang akan membuka modal order. Jadi tidak perlu perubahan di sini, hanya pastikan fungsinya berjalan.\n\n3. Di modal order, pastikan kita bisa mengirim pesan WhatsApp dengan data yang benar.\n\nNamun, perhatikan bahwa sebelumnya di modal order, kita membuka modal order dengan memilih produk dan paket default (paket pertama). Sekarang, di modal detail kita tidak memilih paket tertentu, maka di modal order kita akan set paket pertama sebagai default.\n\nPerubahan kode:\n\n- Hapus bagian `product-packages` dari setiap produk card di HTML.\n\n- Pastikan fungsi `openDetailModal` dan `openOrderModal` tetap berjalan.\n\nMari kita modifikasi:\n\n1. Hapus bagian ini dari setiap produk card (produk 1, 2, dan 3):\n\n```html\n\n<div class=\"product-packages\">\n\n... <!-- daftar paket dan harga -->\n\n</div>\n\n```\n\n2. Di modal detail, kita sudah menampilkan paket-paket. Tombol \"ORDER SEKARANG\" sudah ada dan berfungsi untuk membuka modal order. Fungsi `orderFromDetailBtn` sudah di-set untuk membuka modal order untuk produk yang sedang dilihat.\n\n3. Di modal order, kita mengisi paket pertama sebagai default jika tidak ada paket yang dipilih sebelumnya (seperti dari tombol order langsung). Karena sekarang kita tidak memilih paket di modal detail, maka di modal order akan menggunakan paket pertama.\n\n4. Pastikan di modal order, ketika tombol \"Order via WhatsApp\" ditekan, data yang terkirim adalah paket yang dipilih di dropdown.\n\nKita akan hapus bagian daftar paket di setiap produk card. Berikut adalah perubahan untuk satu produk (lakukan untuk ketiga produk):\n\nSebelum:\n\n```html\n\n<div class=\"product-content\">\n\n<h3 class=\"product-title\">Script Bot Premium</h3>\n\n<p class=\"product-description\">Script bot dengan fitur lengkap untuk otomasi tugas dan meningkatkan produktivitas Anda.</p>\n\n<!-- Hapus bagian ini -->\n\n<div class=\"product-packages\">\n\n<div class=\"package-item\">\n\n<span class=\"package-name\">Basic</span>\n\n<span class=\"package-price\">Rp 100.000</span>\n\n</div>\n\n...\n\n</div>\n\n<!-- Sampai sini -->\n\n<div class=\"product-actions\">\n\n...\n\n</div>\n\n</div>\n\n```\n\nSetelah dihapus, maka di produk card tidak ada lagi daftar paket.\n\nKita juga perlu memastikan bahwa di modal detail, daftar paket ditampilkan dengan benar. Itu sudah dilakukan oleh fungsi `openDetailModal`.\n\nKita juga perlu memastikan bahwa ketika",
    "packages": []
  }
]